{   
    "git config" : "Configarações do git",
    "git init" : "inicializa um repositório",
    "git status" : "Mostra o estado atual do diretório de trabalho (Working Directory).",
    "git add" : {
        "git add" : "Adiciona os arquivos desejados na área de teste (Staging Area).",
        "git add <arquivo>" : "Adiciona apenas o arquivo passado na Staging Area.",
        "git add ." : "Adiciona todos os arquivos da Working Directory na Staging Area."
    },
    "git commit" : {
        "git commit" : "Armazena os arquivos da Staging Area permanentemente no repositório git.",
        "git commit -m" : "Adiciona uma mensagem descritiva do commit."
    },
    "git log" : "Mostra o histórico dos commits que foram feitos.",
    "git diff" : "Mostra o que foi adicionado ou excluído com relação ao commit anterior",
    "git remote" : {
        "git remote" : "Gerencia o vínculo do repositório local com um repositório remoto.",
        "git remote add" : "Informa que deverá ser adicionado um novo controle remoto, diz que será criado o vínculo do repositório local com o remoto.",
        "git remote add origin" : "origin é um alias(apelido) padrão para o nome do repositório remoto que será vínculado",
        "git remote add origin url_do_repositorio_remoto" : "Comando completo para o vínculo entre o repositório local e o remoto."
    },
    "git push" : "Atualiza repositório remoto com base no último commit feito no repositório local.",    
    "git clone" : "Baixa um repositório já existente",
    "git pull" : "Atualiza o repositório local com base em um repositório remoto",
    "git checkout" : {
        "git checkout" : "Permite navegar pelo repositório, seja pelo histórico de commits ou pelas branchs existentes",
        "git checkout hash_do_commit" : "Volta o repositório para o estado em que se encontravam na hash passada",
        "git checkout master" : "Volta o repositório para o branch princípal em seu último estado commitado",
        "git checkout -- caminho-ou-arquivo" : "Desfaz todas as alterações que não fora adicionadas na Staging Area.",
        "git checkout HEAD -- caminho-ou-arquivo" : "Desfaz todas as alterações feitas nos arquivos, mesmo eles já estando na Staging Area."
    },
    "git revert": "reverte um commit fazendo um outro commit com o log da alteração",
    "git reset" : {
        "git reset" : "Desfaz sem deixar rastros do que foi feito.",
        "git reset hash_do_commit --hard" : "Volta o reposítorio para o estado da hash passada",
        "git reset HEAD~1" : "Remove o um commit deixando na Working Area a remoção feita"
    },
    "git branch" : {
        "git branch" : "Cria novos ramos de um repositório, o que permite fazer alterações no projeto sem mexer no repositório principal(master)",
        "git branch nome_do_novo_ramo" : "Cria um novo branch com o nome passado",
        "git checkout nome_da_branch" : "Muda para a branch passada"
    }

}